[
  {
    "Id": 1,
    "username": "jane.doe@mail.com",
    "postText": "Great win by Maccabi Tel Aviv tonight! The energy in the arena was absolutely electrifying. The team played with such determination and heart. It's amazing to see how they've improved throughout the season. I can't wait to see how they continue in the playoffs. Maccabi has truly become one of the top contenders this year, and the fans are loving it. What a game!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_1.webp",
    "time": 1696512000000,
    "active": true,
    "Likes": 12
  },
  {
    "Id": 2,
    "username": "john.smith@mail.com",
    "postText": "FC Barcelona's basketball team is on fire this season! Their ball movement, defense, and shooting are all top-notch. It's incredible to watch how smoothly they play together. Each game, they seem to elevate their performance even more. I'm really excited to see how they will fare in the upcoming games and if they can maintain this level of intensity throughout the playoffs. Barcelona fans should be proud!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_2.webp",
    "time": 1696598400000,
    "active": true,
    "Likes": 18
  },
  {
    "Id": 3,
    "username": "alex.jones@mail.com",
    "postText": "Olympiacos is showing real strength in the EuroLeague this year. Their defense is rock solid, and their offensive execution is sharp. They’ve been consistent all season, which makes them a real threat. It's been a while since I've seen such a cohesive unit play this well together. I think this could be their year to make a deep run into the final four. Their fans are really behind them, and it shows in every game.",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_3.jpg",
    "time": 1696684800000,
    "active": true,
    "Likes": 9
  },
  {
    "Id": 4,
    "username": "mike.brown@mail.com",
    "postText": "Real Madrid Basketball just keeps getting better! Every game they seem to push the limits of what they can achieve. Their roster is deep, their coaching is brilliant, and the chemistry on the court is unmatched. It's no surprise they’re always in the conversation for top teams in Europe. It will be interesting to see how they match up against the other elite teams in the playoffs. I’m expecting big things from them this season!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_4.jpg",
    "time": 1696771200000,
    "active": true,
    "Likes": 15
  },
  {
    "Id": 5,
    "username": "jane.doe@mail.com",
    "postText": "The EuroLeague playoffs are going to be epic this year! With so many strong teams competing, it's anyone's game. I’m especially excited to see the matchups between some of the top contenders like Maccabi Tel Aviv, Barcelona, and Olympiacos. Every game is going to be a nail-biter, and I can’t wait to see which teams rise to the occasion. The level of basketball is just so high this season. EuroLeague fans are in for a treat!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_5.jpg",
    "time": 1696857600000,
    "active": true,
    "Likes": 20
  },
  {
    "Id": 6,
    "username": "john.smith@mail.com",
    "postText": "Zalgiris Kaunas is definitely a team to watch! They might not have the star power of some other teams, but their teamwork and determination are truly remarkable. They've pulled off some amazing upsets this season, and they are playing with a lot of heart. It wouldn’t surprise me at all if they make a deep run in the playoffs. The fans in Kaunas are some of the best in Europe, and the atmosphere in their home games is electric!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_6.jpg",
    "time": 1696944000000,
    "active": true,
    "Likes": 8
  },
  {
    "Id": 7,
    "username": "mike.brown@mail.com",
    "postText": "Anadolu Efes is always competitive in the EuroLeague! They’ve had some ups and downs this season, but when they’re at their best, they can go toe-to-toe with any team. Their offensive firepower is amazing, and when they lock in defensively, they’re nearly unstoppable. I'm eager to see how they perform in the playoffs. If they can find their rhythm, I think they have a real shot at making it to the Final Four.",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_7.webp",
    "time": 1697030400000,
    "active": true,
    "Likes": 11
  },
  {
    "Id": 8,
    "username": "jane.doe@mail.com",
    "postText": "I can't believe the intensity of the last game! Both teams gave it their all, and it was one of the most exciting matches I’ve seen all season. The crowd was on the edge of their seats the entire time. This is why I love EuroLeague basketball—every game feels like a championship match. If the rest of the season is anything like this, we’re in for some unforgettable moments. Can’t wait for the next game!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_8.jpg",
    "time": 1697116800000,
    "active": true,
    "Likes": 7
  },
  {
    "Id": 9,
    "username": "alex.jones@mail.com",
    "postText": "The upcoming EuroLeague Final Four is going to be exciting! With teams like Real Madrid, Barcelona, and Olympiacos in the mix, it’s shaping up to be one of the most competitive Final Fours in recent memory. I’m really curious to see which team will come out on top. No matter what happens, I know the games will be intense, and the fans will be treated to some high-quality basketball. Let the games begin!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_9.jpg",
    "time": 1697203200000,
    "active": true,
    "Likes": 14
  },
  {
    "Id": 10,
    "username": "john.smith@mail.com",
    "postText": "Who do you think will win the EuroLeague this year? It’s such a tough call with so many great teams playing at such a high level. Personally, I think Real Madrid has a strong chance, but Barcelona and Olympiacos are also in top form. It’s going to come down to who can stay healthy and execute their game plan under pressure. No matter what, it's going to be a thrilling conclusion to the season!",
    "postPicFile:": null,
    "postPic": "/publicPictures/postPic_10.jpeg",
    "time": 1697289600000,
    "active": true,
    "Likes": 10
  }
]
